#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infrastructure relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/devmastery/devmastery/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/devmastery/devmastery

To view this run in a browser, visit:
https://app.terraform.io/app/devmastery/base/runs/run-xtmQGfhKqtQofqAX

Waiting for the plan to start...

Terraform v1.3.0
on linux_amd64
Initializing plugins and modules...
module.lambda-newsletter-subscription-request-handler.data.external.archive_prepare[0]: Reading...
module.lambda-newsletter-subscription-request-handler.data.aws_region.current: Reading...
module.lambda-newsletter-subscription-request-handler.data.aws_caller_identity.current: Reading...
aws_api_gateway_rest_api.newsletter_subscription_api: Refreshing state... [id=lnd4sb1118]
module.rds-aurora[0].data.aws_partition.current: Reading...
module.lambda-newsletter-subscription-request-handler.data.aws_region.current: Read complete after 0s [id=ca-central-1]
module.lambda-newsletter-subscription-request-handler.data.aws_partition.current: Reading...
data.aws_rds_engine_version.postgresql: Reading...
module.rds-aurora[0].data.aws_iam_policy_document.monitoring_rds_assume_role: Reading...
module.rds-aurora[0].data.aws_iam_policy_document.monitoring_rds_assume_role: Read complete after 0s [id=1813475199]
aws_db_parameter_group.postgresql14: Refreshing state... [id=dm-aurora-db-postgres-parameter-group]
module.lambda-newsletter-subscription-request-handler.data.aws_iam_policy_document.assume_role[0]: Reading...
module.rds-aurora[0].data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda-newsletter-subscription-request-handler.data.aws_partition.current: Read complete after 0s [id=aws]
aws_rds_cluster_parameter_group.postgresql14: Refreshing state... [id=dm-aurora-postgres-cluster-parameter-group]
module.lambda-newsletter-subscription-request-handler.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3693445097]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-047cc163bc32f9c63]
module.rds-aurora[0].aws_iam_role.rds_enhanced_monitoring[0]: Refreshing state... [id=terraform-20230225200307833400000001]
module.lambda-newsletter-subscription-request-handler.data.aws_iam_policy.vpc[0]: Reading...
module.lambda-newsletter-subscription-request-handler.data.aws_caller_identity.current: Read complete after 0s [id=508057717228]
module.lambda-newsletter-subscription-request-handler.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.rds-aurora[0].aws_iam_role_policy_attachment.rds_enhanced_monitoring[0]: Refreshing state... [id=terraform-20230225200307833400000001-20230225200308352900000002]
data.aws_rds_engine_version.postgresql: Read complete after 0s [id=14.6]
module.lambda-newsletter-subscription-request-handler.data.aws_iam_policy.vpc[0]: Read complete after 0s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaENIManagementAccess]
module.rds-aurora[0].aws_security_group.this[0]: Refreshing state... [id=sg-04905b235f678a468]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0aa6bd443aa98d474]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-00946d27ed0da0428]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-01bc340a0b260a576]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-04a5def6c836870f2]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-082f4b3fc14ac4ab5]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0e924e4f34d74a84e]
module.vpc.aws_route_table.database[0]: Refreshing state... [id=rtb-0bd0aae47da69e7b2]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0134976a0271c4dbe]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-00254f2e894d49ae7]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0c146abcf9be4e5cc]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0a7713827cbd44342]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0aa6bd443aa98d4741080289494]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=vpc-dev]
module.vpc.aws_route.database_internet_gateway[0]: Refreshing state... [id=r-rtb-0bd0aae47da69e7b21080289494]
module.rds-aurora[0].aws_db_subnet_group.this[0]: Refreshing state... [id=dm-dev-aurorav2-1]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-082f24e7b7c154465]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-02cbf108c39429be8]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0a6cc174fba3ab2bd]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0e9db314492e2d792]
module.rds-aurora[0].aws_security_group_rule.cidr_ingress[0]: Refreshing state... [id=sgrule-3502655924]
module.rds-aurora[0].aws_rds_cluster.this[0]: Refreshing state... [id=dm-dev-aurorav2-1]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-051dd6ea88a46ed93]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01a9581529b9c2e90]
module.rds-aurora[0].aws_rds_cluster_instance.this["a"]: Refreshing state... [id=dm-dev-aurorav2-1-a]
module.rds-aurora[0].aws_rds_cluster_instance.this["b"]: Refreshing state... [id=dm-dev-aurorav2-1-b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_api_gateway_rest_api.newsletter_subscription_api will be destroyed
  # (because aws_api_gateway_rest_api.newsletter_subscription_api is not in configuration)
  - resource "aws_api_gateway_rest_api" "newsletter_subscription_api" {
      - api_key_source               = "HEADER" -> null
      - arn                          = "arn:aws:apigateway:ca-central-1::/restapis/lnd4sb1118" -> null
      - binary_media_types           = [] -> null
      - body                         = <<-EOT
            openapi: 3.0.2
            info:
              title: Newsletter Subscription API
              version: 1.0.0
              description: An API to manage Newsletter Subscriptions
            paths:
              /newsletter-subscriptions:
                summary: Path used to manage the list of newslettersubscriptions.
                description: >-
                  The REST endpoint/path used to list and create zero or more `NewsletterSubscription` entities. 
                  This path contains a `GET` and `POST` operation to perform the list and create tasks,
                  respectively.
                get:
                  x-amazon-apigateway-integration:
                    responses:
                      default:
                        statusCode: "200"
                    passthroughBehavior: when_no_match
                    httpMethod: GET
                    type: aws_proxy
                  responses:
                    "200":
                      content:
                        application/json:
                          schema:
                            type: array
                            items:
                              $ref: "#/components/schemas/NewsletterSubscription"
                      description: Successful response - returns an array of `NewsletterSubscription` entities.
                  operationId: getNewsletterSubscriptions
                  summary: List All NewsletterSubscriptions
                  description: Gets a list of all `NewsletterSubscription` entities.
                post:
                  x-amazon-apigateway-integration:
                    responses:
                      default:
                        statusCode: "201"
                    passthroughBehavior: when_no_match
                    httpMethod: POST
                    type: aws_proxy
                  requestBody:
                    description: A new `NewsletterSubscription` to be created.
                    content:
                      application/json:
                        schema:
                          $ref: "#/components/schemas/NewsletterSubscription"
                    required: true
                  responses:
                    "201":
                      description: Successful response.
                  operationId: createNewsletterSubscription
                  summary: Create a NewsletterSubscription
                  description: Creates a new instance of a `NewsletterSubscription`.
              "/newsletter-subscriptions/{newsletterSubscriptionId}":
                summary: Path used to manage a single NewsletterSubscription.
                description: >-
                  The REST endpoint/path used to get, update, and delete single instances of an
                  `NewsletterSubscription`.  This path contains `GET`, `PUT`, and `DELETE` operations used to
                  perform the get, update, and delete tasks, respectively.
                get:
                  x-amazon-apigateway-integration:
                    responses:
                      default:
                        statusCode: "200"
                    passthroughBehavior: when_no_match
                    httpMethod: GET
                    type: aws_proxy
                  responses:
                    "200":
                      content:
                        application/json:
                          schema:
                            $ref: "#/components/schemas/NewsletterSubscription"
                      description: Successful response - returns a single `NewsletterSubscription`.
                  operationId: getNewsletterSubscription
                  summary: Get a NewsletterSubscription
                  description: Gets the details of a single instance of a `NewsletterSubscription`.
                put:
                  x-amazon-apigateway-integration:
                    responses:
                      default:
                        statusCode: "202"
                    passthroughBehavior: when_no_match
                    httpMethod: PUT
                    type: aws_proxy
                  requestBody:
                    description: Updated `NewsletterSubscription` information.
                    content:
                      application/json:
                        schema:
                          $ref: "#/components/schemas/NewsletterSubscription"
                    required: true
                  responses:
                    "202":
                      description: Successful response.
                  operationId: updateNewsletterSubscription
                  summary: Update a NewsletterSubscription
                  description: Updates an existing `NewsletterSubscription`.
                delete:
                  x-amazon-apigateway-integration:
                    responses:
                      default:
                        statusCode: "204"
                    passthroughBehavior: when_no_match
                    httpMethod: DELETE
                    type: aws_proxy
                  responses:
                    "204":
                      description: Successful response.
                  operationId: deleteNewsletterSubscription
                  summary: Delete a NewsletterSubscription
                  description: Deletes an existing `NewsletterSubscription`.
                parameters:
                  - examples:
                      UUID:
                        value: 76b02a81-f8a6-4d09-b19c-250336249f78
                    name: newsletterSubscriptionId
                    description: A unique identifier for a `NewsletterSubscription`.
                    schema:
                      type: string
                    in: path
                    required: true
            components:
              schemas:
                NewsletterSubscription:
                  title: Root Type for NewsletterSubscription
                  description: ""
                  required:
                    - emailAddress
                    - id
                    - informedConsent
                    - subscribedAt
                    - newsletterId
                    - firstName
                  type: object
                  properties:
                    id:
                      pattern: '^[0-9a-fA-F]{8}\b-[0-9a-fA-F]{4}\b-[0-9a-fA-F]{4}\b-[0-9a-fA-F]{4}\b-[0-9a-fA-F]{12}$'
                      type: string
                      example: 757f2ef1-08dd-4856-a375-22daf5beb19b
                    firstName:
                      minLength: 2
                      type: string
                      example: Aisha
                    emailAddress:
                      type: string
                      example: a.jones@abc.com
                    newsletterId:
                      pattern: '^[0-9a-fA-F]{8}\b-[0-9a-fA-F]{4}\b-[0-9a-fA-F]{4}\b-[0-9a-fA-F]{4}\b-[0-9a-fA-F]{12}$'
                      type: string
                      example: 66e4c6f6-3263-4fba-99a9-ff188c50befc
                    verifiedEmailAddress:
                      pattern: '[^@ \t\r\n]+@[^@ \t\r\n]+\.[^@ \t\r\n]+'
                      type: string
                      example: a.jones@abc.com
                    informedConsent:
                      pattern: '[^@ \t\r\n]+@[^@ \t\r\n]+\.[^@ \t\r\n]+'
                      type: string
                      example: I agree to receive emails from DevMastery.com
                    subscribedAt:
                      format: date-time
                      type: string
                      example: "2023-02-02T00:00:00Z"
                  example:
                    id: 757f2ef1-08dd-4856-a375-22daf5beb19b
                    firstName: Aisha
                    emailAddress: a.jones@abc.com
                    newsletterId: 66e4c6f6-3263-4fba-99a9-ff188c50befc
                    verifiedEmailAddress: a.jones@abc.com
                    informedConsent: I agree to receive emails from DevMastery.com
                    subscribedAt: "2023-02-02T00:00:00Z"
        EOT -> null
      - created_date                 = "2023-02-26T15:56:58Z" -> null
      - description                  = "A service for subscribing to newsletters" -> null
      - disable_execute_api_endpoint = false -> null
      - execution_arn                = "arn:aws:execute-api:ca-central-1:508057717228:lnd4sb1118" -> null
      - id                           = "lnd4sb1118" -> null
      - minimum_compression_size     = -1 -> null
      - name                         = "newsletter-subscription-api" -> null
      - root_resource_id             = "8zm9g34k06" -> null
      - tags                         = {} -> null
      - tags_all                     = {} -> null

      - endpoint_configuration {
          - types            = [
              - "EDGE",
            ] -> null
          - vpc_endpoint_ids = [] -> null
        }
    }

  # module.lambda-newsletter-subscription-request-handler.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.lambda-newsletter-subscription-request-handler.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/handleNewsletterSubscriptionRequest"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment"  = "dev"
          + "Organization" = "DevMastery"
        }
      + tags_all          = {
          + "Environment"  = "dev"
          + "Organization" = "DevMastery"
        }
    }

  # module.lambda-newsletter-subscription-request-handler.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "handleNewsletterSubscriptionRequest-logs"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "Environment"  = "dev"
          + "Organization" = "DevMastery"
        }
      + tags_all  = {
          + "Environment"  = "dev"
          + "Organization" = "DevMastery"
        }
    }

  # module.lambda-newsletter-subscription-request-handler.aws_iam_policy.vpc[0] will be created
  + resource "aws_iam_policy" "vpc" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "handleNewsletterSubscriptionRequest-vpc"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:AssignPrivateIpAddresses",
                          + "ec2:UnassignPrivateIpAddresses",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags      = {
          + "Environment"  = "dev"
          + "Organization" = "DevMastery"
        }
      + tags_all  = {
          + "Environment"  = "dev"
          + "Organization" = "DevMastery"
        }
    }

  # module.lambda-newsletter-subscription-request-handler.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "handleNewsletterSubscriptionRequest"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment"  = "dev"
          + "Organization" = "DevMastery"
        }
      + tags_all              = {
          + "Environment"  = "dev"
          + "Organization" = "DevMastery"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.lambda-newsletter-subscription-request-handler.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "handleNewsletterSubscriptionRequest"
    }

  # module.lambda-newsletter-subscription-request-handler.aws_iam_role_policy_attachment.vpc[0] will be created
  + resource "aws_iam_role_policy_attachment" "vpc" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "handleNewsletterSubscriptionRequest"
    }

  # module.lambda-newsletter-subscription-request-handler.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Handles newsletter subscription requests"
      + filename                       = "builds/d98dcd39544e9b9c934ac301a3b54c1a2fa8ab711e4a855c0075eb33af3f8504.zip"
      + function_name                  = "handleNewsletterSubscriptionRequest"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs16.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"  = "dev"
          + "Organization" = "DevMastery"
        }
      + tags_all                       = {
          + "Environment"  = "dev"
          + "Organization" = "DevMastery"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + ephemeral_storage {
          + size = 512
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-02cad3085b0d936db",
            ]
          + subnet_ids         = [
              + "subnet-0a7713827cbd44342",
              + "subnet-0c146abcf9be4e5cc",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.lambda-newsletter-subscription-request-handler.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "./lambda/",
                      + null,
                    ],
                ]
              + filename      = "builds/d98dcd39544e9b9c934ac301a3b54c1a2fa8ab711e4a855c0075eb33af3f8504.zip"
              + runtime       = "nodejs16.x"
            }
        )
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/d98dcd39544e9b9c934ac301a3b54c1a2fa8ab711e4a855c0075eb33af3f8504.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda-newsletter-subscription-request-handler.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/d98dcd39544e9b9c934ac301a3b54c1a2fa8ab711e4a855c0075eb33af3f8504.zip"
          + "timestamp" = "1677441774136497000"
        }
    }

  # module.lambda-newsletter-subscription-request-handler.null_resource.sam_metadata_aws_lambda_function[0] will be created
  + resource "null_resource" "sam_metadata_aws_lambda_function" {
      + id       = (known after apply)
      + triggers = {
          + "built_output_path"    = "builds/d98dcd39544e9b9c934ac301a3b54c1a2fa8ab711e4a855c0075eb33af3f8504.zip"
          + "original_source_code" = "\"./lambda/\""
          + "resource_name"        = "aws_lambda_function.this[0]"
          + "resource_type"        = "ZIP_LAMBDA_FUNCTION"
          + "source_code_property" = "path"
        }
    }

Plan: 10 to add, 0 to change, 1 to destroy.


```
</details>
*Pushed by: @arcdev1, Action: `pull_request`*